In [1]:
# Feature Engineering

# Transform data to create some new column, new features that improve the performance of our model

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("pd_employee_data.csv")

In [3]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [4]:
# Create a new column where we store the tax amount

# # .apply() - Write the logic inside a function than pass that function in apply()

In [5]:
df2 = df.copy()

df2["tax"] = df2["income"].apply(lambda x : "20%" if x >= 50000 else "10%")
# here apply function is higher order function bcz anather funcyion is inside this function

df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  20%
1    1      John Doe  29.0     USA     Male  55000.0  20%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  20%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  20%

In [6]:
# map() - map some value with existing value

# Convert female to F, male to M and Unknown to U

In [7]:
gender_map = {
    "Male" : "M",
    "Female" : "F",
    "Unknown" : "U"
}

df2["gender"] = df2["gender"].map(gender_map)

In [8]:
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [9]:
# assign() - By this we create a new column by assigning some value
df2.assign(new_income = df2["income"] * 1.1) # 1.1 for increase by 10%

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
1    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0

In [10]:
# Replace(old,new)
# Replace the country USA to US

In [11]:
df2["country"] = df2["country"].replace("USA", "US")

In [12]:
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0      US      M  55000.0  20%
1    1      John Doe  29.0      US      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN      US      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0      US      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0      US    NaN  58000.0  20%

In [13]:
# rename( columns = {old : new})

In [14]:
# Rename all column (here change to first letter Uppar case)
df2.columns = ["ID", "Name", "Age", "Country", "gender", "Income", "Tax"]

In [15]:
df2

    ID          Name   Age Country gender   Income  Tax
0    1      John Doe  29.0      US      M  55000.0  20%
1    1      John Doe  29.0      US      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN      US      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0      US      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0      US    NaN  58000.0  20%

In [16]:
# Rename specific column
df2.rename( columns = {"Age":"Age Value"})

    ID          Name  Age Value Country gender   Income  Tax
0    1      John Doe       29.0      US      M  55000.0  20%
1    1      John Doe       29.0      US      M  55000.0  20%
2    2    Jane Smith        NaN  Canada      F  62000.0  20%
3    3          Alex        NaN      US      U  47000.0  10%
4    4  Maria Garcia       34.0   Spain      F      NaN  10%
5    5        Li Wei       27.0   China      M  51000.0  20%
6    6           NaN       45.0   India      F  73000.0  20%
7    7    Ahmed Khan       38.0     NaN      M  68000.0  20%
8    8    Rachel Lee       29.0      US      F  62000.0  20%
9    9   Carlos Ruiz        NaN  Mexico      M  45000.0  10%
10  10   Emily Davis       31.0      US    NaN  58000.0  20%

In [17]:
# Rename label
df2.rename(index = {0:"First"})

       ID          Name   Age Country gender   Income  Tax
First   1      John Doe  29.0      US      M  55000.0  20%
1       1      John Doe  29.0      US      M  55000.0  20%
2       2    Jane Smith   NaN  Canada      F  62000.0  20%
3       3          Alex   NaN      US      U  47000.0  10%
4       4  Maria Garcia  34.0   Spain      F      NaN  10%
5       5        Li Wei  27.0   China      M  51000.0  20%
6       6           NaN  45.0   India      F  73000.0  20%
7       7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8       8    Rachel Lee  29.0      US      F  62000.0  20%
9       9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10     10   Emily Davis  31.0      US    NaN  58000.0  20%

In [21]:
# sort_values()
df2.sort_values("Income")  #assending order
# df2["Income"].sort_values()

# df2.sort_values("Income", "Age") - We can sort on the basis of multiple columns also

    ID          Name   Age Country gender   Income  Tax
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
3    3          Alex   NaN      US      U  47000.0  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
1    1      John Doe  29.0      US      M  55000.0  20%
0    1      John Doe  29.0      US      M  55000.0  20%
10  10   Emily Davis  31.0      US    NaN  58000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
8    8    Rachel Lee  29.0      US      F  62000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%

In [24]:
# Descending order
sorted_df = df2.sort_values("Income", ascending = False)

In [25]:
sorted_df

    ID          Name   Age Country gender   Income  Tax
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0      US      F  62000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
10  10   Emily Davis  31.0      US    NaN  58000.0  20%
0    1      John Doe  29.0      US      M  55000.0  20%
1    1      John Doe  29.0      US      M  55000.0  20%
5    5        Li Wei  27.0   China      M  51000.0  20%
3    3          Alex   NaN      US      U  47000.0  10%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%

In [26]:
# sort_index()
sorted_df.sort_index()

    ID          Name   Age Country gender   Income  Tax
0    1      John Doe  29.0      US      M  55000.0  20%
1    1      John Doe  29.0      US      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN      US      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0      US      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0      US    NaN  58000.0  20%

In [27]:
# Reset index value

In [28]:
sorted_df.reset_index()

    index  ID          Name   Age Country gender   Income  Tax
0       6   6           NaN  45.0   India      F  73000.0  20%
1       7   7    Ahmed Khan  38.0     NaN      M  68000.0  20%
2       8   8    Rachel Lee  29.0      US      F  62000.0  20%
3       2   2    Jane Smith   NaN  Canada      F  62000.0  20%
4      10  10   Emily Davis  31.0      US    NaN  58000.0  20%
5       0   1      John Doe  29.0      US      M  55000.0  20%
6       1   1      John Doe  29.0      US      M  55000.0  20%
7       5   5        Li Wei  27.0   China      M  51000.0  20%
8       3   3          Alex   NaN      US      U  47000.0  10%
9       9   9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10      4   4  Maria Garcia  34.0   Spain      F      NaN  10%

In [29]:
# if we dont want to preserve original index
sorted_df.reset_index(drop = True)

    ID          Name   Age Country gender   Income  Tax
0    6           NaN  45.0   India      F  73000.0  20%
1    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
2    8    Rachel Lee  29.0      US      F  62000.0  20%
3    2    Jane Smith   NaN  Canada      F  62000.0  20%
4   10   Emily Davis  31.0      US    NaN  58000.0  20%
5    1      John Doe  29.0      US      M  55000.0  20%
6    1      John Doe  29.0      US      M  55000.0  20%
7    5        Li Wei  27.0   China      M  51000.0  20%
8    3          Alex   NaN      US      U  47000.0  10%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10   4  Maria Garcia  34.0   Spain      F      NaN  10%

In [37]:
# rank() : We can assign rank from lowest to heighst value
# Give rank on the basis of income
sorted_df["Ranking"] = sorted_df["Income"].rank() # if we pass ascending = false then it rank alternately
# If we want a whole value in each ranking then we use:  method = "dense" : here 4 be print
# If we want a min value of same rank then we use:  method = "min" : here 4 be print
# If we want a max value of same rank then we use:  method = "max" : here 5 be print
# When two value are same it print the average value like 4.5 in output
sorted_df

    ID          Name   Age Country gender   Income  Tax  Ranking
6    6           NaN  45.0   India      F  73000.0  20%     10.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%      9.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%      7.5
2    2    Jane Smith   NaN  Canada      F  62000.0  20%      7.5
10  10   Emily Davis  31.0      US    NaN  58000.0  20%      6.0
0    1      John Doe  29.0      US      M  55000.0  20%      4.5
1    1      John Doe  29.0      US      M  55000.0  20%      4.5
5    5        Li Wei  27.0   China      M  51000.0  20%      3.0
3    3          Alex   NaN      US      U  47000.0  10%      2.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%      1.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%      NaN

In [42]:
# Reorder
# if we want age column to be lst
sorted_df[["ID", "Name", "Country", "gender", "Income", "Tax", "Age"]]

    ID          Name Country gender   Income  Tax   Age
6    6           NaN   India      F  73000.0  20%  45.0
7    7    Ahmed Khan     NaN      M  68000.0  20%  38.0
8    8    Rachel Lee      US      F  62000.0  20%  29.0
2    2    Jane Smith  Canada      F  62000.0  20%   NaN
10  10   Emily Davis      US    NaN  58000.0  20%  31.0
0    1      John Doe      US      M  55000.0  20%  29.0
1    1      John Doe      US      M  55000.0  20%  29.0
5    5        Li Wei   China      M  51000.0  20%  27.0
3    3          Alex      US      U  47000.0  10%   NaN
9    9   Carlos Ruiz  Mexico      M  45000.0  10%   NaN
4    4  Maria Garcia   Spain      F      NaN  10%  34.0

In [52]:
# TASK
# Shift ID column to last

df2 = df.copy()

new_col_order = [col for col in df2.columns if col != "id"] + ["id"]
print(new_col_order)
df2[new_col_order]

['name', 'age', 'country', 'gender', 'income', 'id']

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10